app/controllers/funcionarios_controller.rb

  def show
    @funcionario = Funcionario.find(params[:id])
        year = Time.now.year.to_s
        month = Time.now.month.to_s
      if params[:month].nil? and params[:year].nil?
    	params[:year] = year
      	params[:month] = month
      end
        year = params[:year].to_i
        month = params[:month].to_i
        first = Date.civil(year, month, 1)
        last = Date.civil(year, month, -1)
      @funcionario.marcar_ponto_fake(params[:year],params[:month])
    	@marcacaopontos = @funcionario.marcacaopontos.find(:all,:conditions => ["(data BETWEEN ? AND ?)", first.to_datetime, last.to_datetime],:order => 'data')
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)
SELECT * FROM "marcacaopontos" WHERE ("marcacaopontos".funcionario_id = 9 AND ((data BETWEEN '2009-04-01 00:00:00' AND '2009-04-30 00:00:00'))) ORDER BY data

  def edit
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)

  def create
    @funcionario = Funcionario.new(params[:funcionario])

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO "funcionarios" ("updated_at", "nome", "cargo", "email", "created_at") VALUES('2009-03-24 15:10:19', 'Gabriela', 'Programadora Asp.Net', 'gabriela@planobe.com.br', '2009-03-24 15:10:19')

  def update
    @funcionario = Funcionario.find(params[:id])

    respond_to do |format|
      if @funcionario.update_attributes(params[:funcionario])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)
UPDATE "funcionarios" SET "nome" = 'Jean Paulo Orlando', "email" = 'jean@planobe.com.br', "updated_at" = '2009-03-31 20:41:19' WHERE "id" = 1