app/controllers/marcacaopontos_controller.rb

SELECT "marcacaopontos".id FROM "marcacaopontos" WHERE ("marcacaopontos"."funcionario_id" = 1 AND "marcacaopontos".id <> 32) LIMIT 1
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)
---
  def create
  	respond_to do |format|
  	  @funcionario = Funcionario.find(params[:marcacaoponto][:funcionario_id])