app/controllers/marcacaopontos_controller.rb

  def index
    @marcacaopontos = Marcacaoponto.find(:all,:order=> 'data desc')
---
SELECT "marcacaopontos".id FROM "marcacaopontos" WHERE ("marcacaopontos"."data" = '2009-03-30' AND "marcacaopontos".funcionario_id = 1 AND "marcacaopontos".id <> 7) LIMIT 1

  def show
    @marcacaoponto = Marcacaoponto.find(params[:id])
---
SELECT * FROM "marcacaopontos" WHERE ("marcacaopontos"."id" = 1)

  def edit
    @marcacaoponto = Marcacaoponto.find(params[:id])
---
SELECT * FROM "marcacaopontos" WHERE ("marcacaopontos".funcionario_id = 8) ORDER BY marcacaopontos.id DESC LIMIT 1

  def create
      #@funcionario = Funcionario.find(params[:marcacaoponto][:funcionario_id])
  	  #@funcionario.marcar_ponto("aowpa")
  	  #flash[:notice] = 'Ponto Criado!'
      #format.html { redirect_to(marcacaopontos_path) }
      #format.xml  { head :ok }
        @marcacaoponto = Marcacaoponto.new(params[:marcacaoponto])
        respond_to do |format|
          if @marcacaoponto.save
---
INSERT INTO "marcacaopontos" ("hora3", "hora4", "updated_at", "funcionario_id", "hora1", "data", "hora2", "created_at") VALUES(NULL, NULL, '2009-03-24 20:20:56', 1, '12:00', '2009-03-24', NULL, '2009-03-24 20:20:56')

  def update
    @marcacaoponto = Marcacaoponto.find(params[:id])

    respond_to do |format|
      if @marcacaoponto.update_attributes(params[:marcacaoponto])
---
SELECT * FROM "marcacaopontos" WHERE ("marcacaopontos"."id" = 40)
UPDATE "marcacaopontos" SET "hora3" = '2009-04-02 22:02:46', "hora2" = '2009-04-02 22:01:21', "hora1" = '2009-04-02 13:45:00', "updated_at" = '2009-04-02 20:51:20', "hora4" = '2009-04-02 23:21:09' WHERE "id" = 40